#### terraform plan every: 4c5f127
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_dynamodb_table.spotify-poc: Refreshing state... [id=spotify-poc]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/aws/lambda/java_lambda_function]
aws_iam_policy.iam_policy_for_lambda: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda-invoke-policy]
aws_iam_role.iam_role_for_lambda: Refreshing state... [id=lambda-invoke-role]
aws_api_gateway_rest_api.example: Refreshing state... [id=uo7vejn591]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-uo7vejn591-6s0om962qh-ANY]
aws_api_gateway_resource.proxy: Refreshing state... [id=ixthbt]
aws_lambda_function.java_lambda_function: Refreshing state... [id=java_lambda_function]
aws_iam_role_policy_attachment.aws_iam_role_policy_attachment: Refreshing state... [id=lambda-invoke-role-20210517054657159100000001]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-uo7vejn591-ixthbt-ANY]
aws_iam_policy.lambda_dynamo: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo-policy]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-uo7vejn591-ixthbt-ANY]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-uo7vejn591-6s0om962qh-ANY]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=lambda-invoke-role-20210517180640035500000001]
aws_api_gateway_deployment.example: Refreshing state... [id=7avmde]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.spotify-dynamo-music will be created
  + resource "aws_dynamodb_table" "spotify-dynamo-music" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UserId"
      + id               = (known after apply)
      + name             = "spotify-dynamo-music"
      + range_key        = "PlaylistId"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "spotify-dynamo-music"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "spotify-dynamo-music"
        }
      + write_capacity   = 1

      + attribute {
          + name = "PlaylistId"
          + type = "S"
        }
      + attribute {
          + name = "TrackId"
          + type = "S"
        }
      + attribute {
          + name = "UserId"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "PlaylistId"
          + name               = "SpotifyDynamoMusicPlaylistIndex"
          + non_key_attributes = [
              + "UserId",
            ]
          + projection_type    = "INCLUDE"
          + range_key          = "TrackId"
          + read_capacity      = 1
          + write_capacity     = 1
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # aws_iam_policy.lambda_dynamo_music will be created
  + resource "aws_iam_policy" "lambda_dynamo_music" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "lambda_dynamo_music-policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_dynamo_music will be created
  + resource "aws_iam_role_policy_attachment" "lambda_dynamo_music" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda-invoke-role"
    }

  # aws_lambda_function.java_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "java_lambda_function" {
        id                             = "java_lambda_function"
      ~ last_modified                  = "2021-06-28T04:10:48.724+0000" -> (known after apply)
      ~ source_code_hash               = "XN281mCxb7MGAR/e3PgJWI5GJs6PZlG9/vgMMQTmTBo=" -> "2OVPannJs7qWxGcGnkK41Lt7rUkfXMMRD/d1nINh3F0="
        tags                           = {}
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*